benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_passthrough_readonly_connect_c100_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 8121
number of failed transactions: 0 (0.000%)
latency average = 370.720 ms
average connection time = 235.188 ms
tps = 269.745586 (including reconnection times)