benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_passthrough_readonly_steady_c50_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 7215526
number of failed transactions: 0 (0.000%)
latency average = 0.415 ms
initial connection time = 177.571 ms
tps = 120610.249054 (without initial connection time)