benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pgcat_readonly_connect_c50_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 6679
number of failed transactions: 0 (0.000%)
latency average = 225.687 ms
average connection time = 222.106 ms
tps = 221.545780 (including reconnection times)