benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pgcat_tpcb_steady_c50_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 523255
number of failed transactions: 0 (0.000%)
latency average = 5.713 ms
initial connection time = 226.723 ms
tps = 8752.377672 (without initial connection time)