benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pool_readonly_connect_c100_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 30 s
number of transactions actually processed: 6076
number of failed transactions: 0 (0.000%)
latency average = 574.221 ms
average connection time = 365.456 ms
tps = 174.148932 (including reconnection times)