benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pool_readonly_steady_c10_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 2105066
number of failed transactions: 0 (0.000%)
latency average = 0.285 ms
initial connection time = 42.941 ms
tps = 35109.349854 (without initial connection time)