benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pool_readonly_steady_c50_r1.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: select only>
scaling factor: 10
query mode: simple
number of clients: 50
number of threads: 50
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 3046637
number of failed transactions: 0 (0.000%)
latency average = 0.981 ms
initial connection time = 249.151 ms
tps = 50987.695958 (without initial connection time)