benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pool_tpcb_steady_c100_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 100
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 524880
number of failed transactions: 0 (0.000%)
latency average = 11.299 ms
initial connection time = 703.959 ms
tps = 8850.154979 (without initial connection time)