benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pool_tpcb_steady_c10_r3.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 10
number of threads: 10
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 330356
number of failed transactions: 0 (0.000%)
latency average = 1.815 ms
initial connection time = 42.855 ms
tps = 5509.708678 (without initial connection time)