benchmark-results/tcp-pool-sanity-20260506-013633/pgbench_stdout/proxy_pool_tpcb_steady_c250_r2.out
pgbench (16.13 (Ubuntu 16.13-0ubuntu0.24.04.1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 10
query mode: simple
number of clients: 250
number of threads: 64
maximum number of tries: 1
duration: 60 s
number of transactions actually processed: 533483
number of failed transactions: 0 (0.000%)
latency average = 27.561 ms
initial connection time = 1216.462 ms
tps = 9070.798281 (without initial connection time)